<?php
/*
 * Created on 2014-7-30
 *
 * To change the template for this generated file go to
 * Window - Preferences - PHPeclipse - PHP - Code Templates
 */
 class ErrorCode{
 	
 	const ERR_210000 = 210000;
 	
 	/*** 异常定义 start 231000-231499 ***/
 	const ERR_231000 = 231000;
 	
 	// 网站类异常
 	const ERR_231100 = 231100;
 	const ERR_231101 = 231101;
 	const ERR_231102 = 231102;
 	const ERR_231103 = 231103;
 	
 	// 财务类异常
 	const ERR_231200 = 231200;
 	const ERR_231201 = 231201;
 	const ERR_231202 = 231202;
 	const ERR_231203 = 231203;
 	const ERR_231204 = 231204;
 	const ERR_231205 = 231205;
 	const ERR_231206 = 231206;
 	const ERR_231207 = 231207;
 	
 	// 搜索类异常
 	const ERR_231300 = 231300;
 	const ERR_231301 = 231301;
 	
 	// BOSS类异常
 	const ERR_231400 = 231400;
 	
 	/*** 异常定义 end ***/
 	
 	/*** 成功定义 start 231500-231549 ***/
 	const ERR_231500 = 231500;
 	const ERR_231501 = 231501;
 	const ERR_231502 = 231502;
 	const ERR_231503 = 231503;
 	const ERR_231504 = 231504;
 	const ERR_231505 = 231505;
 	const ERR_231506 = 231506;
 	const ERR_231507 = 231507;
 	const ERR_231508 = 231508;
 	const ERR_231509 = 231509;
 	const ERR_231510 = 231510;
 	const ERR_231511 = 231511;
 	/*** 成功定义 end ***/
 	
 	/*** 前台失败定义 start 231550-231749 ***/
	// 查询类 <600 	
 	const ERR_231550 = 231550;
 	const ERR_231551 = 231551;
 	const ERR_231552 = 231552;
 	
 	// 保存类 <650
 	const ERR_231600 = 231600;
 	const ERR_231601 = 231601;
 	const ERR_231602 = 231602;
 	const ERR_231603 = 231603;
 	const ERR_231604 = 231604;
 	const ERR_231605 = 231605;
 	const ERR_231606 = 231606;
 	const ERR_231607 = 231607;
 	const ERR_231608 = 231608;
 	const ERR_231609 = 231609;
 	const ERR_231610 = 231610;
 	const ERR_231611 = 231611;
    const ERR_231612 = 231612;
    const ERR_231613 = 231613;
    const ERR_231614 = 231614;
    const ERR_231615 = 231615;
 	
 	// 财务类 <700
	const ERR_231650 = 231650;
	const ERR_231651 = 231651;
	const ERR_231652 = 231652;
	const ERR_231653 = 231653;
	const ERR_231654 = 231654;
	const ERR_231655 = 231655;
	const ERR_231656 = 231656;
	
	// 校验类<750
	const ERR_231700 = 231700;
	const ERR_231701 = 231701;
	const ERR_231702 = 231702;
	const ERR_231703 = 231703;
	const ERR_231704 = 231704;
	const ERR_231705 = 231705;
	const ERR_231706 = 231706;
	const ERR_231707 = 231707;
	const ERR_231708 = 231708;
	const ERR_231709 = 231709;
	
	/*** 前台失败定义 end ***/
 	
 	static $errorCodeMap=array("230098"=>"登录失效",
							"230010"=>"上传文件失败",
							"210000"=>"参数不正确",
							
							/*** 异常定义 start 231000-231499 ***/
							"231000"=>"未知异常！",
							
							// 网站类异常
							"231100" => "调用网站上下线分类页打包产品发生异常！",
							"231101" => "查询网站频道页板块广告位列表异常！",
							"231102" => "查询网站导航树异常！",
							"231103" => "查询网站首页板块广告位列表异常！",
							
							// 财务类异常
							"231200" => "获取财务可用账户余额失败！",
							"231201" => "财务冻结失败！",
							"231202" => "财务扣费失败！",
							"231203" => "财务解冻失败！",
							"231204" => "查询供应商在推广日期当天及以后仍然有效的账户余额失败！",
							"231205" => "调用财务分类页打包产品直接扣款发生异常！",
							"231206" => "获取财务系统财务报表失败！",
							"231207" => "获取财务系统消耗明细失败！",
							
							// 搜索类异常
							"231300" => "调用搜索产品查询列表发生异常！",
							"231301" => "调用搜索分类页接口查询分类发生异常！",
							
							// BOSS类异常
							"231400" => "调用BOSS查询产品经理发生异常！",
							
							/*** 异常定义 end ***/
							
							/*** 成功定义 start 231500-231549 ***/
							"231500"=>"查询成功！",
							"231501"=>"保存成功！",
							"231502"=>"新增成功！",
							"231503"=>"更新成功！",
							"231504"=>"发布成功！",
							"231505"=>"确认成功！",
							"231506"=>"删除成功！",
							"231507"=>"扣款成功！",
							"231508"=>"冻结成功！",
							"231509"=>"解冻成功！",
							"231510"=>"退款成功！",
							"231511"=>"配置成功！",
							/*** 成功定义 end ***/
							
							/*** 前台失败定义 start 231550-231749 ***/
							// 查询类 <600
							"231550"=>"查询失败！",
							"231551"=>"查询供应商帐号列表入参错误：limit为空！",
							"231552"=>"获取报表信息失败！",
							
							// 保存类 <650
							"231600"=>"保存失败！",
							"231601"=>"新增失败！",
							"231602"=>"更新失败！",
							"231603"=>"发布失败！",
							"231604"=>"确认失败！",
							"231605"=>"删除失败！",
							"231606"=>"配置失败！",
							"231607"=>"供应商账户余额不足，当前余额：",
							"231608"=>"插入财务消息失败！",
							"231609"=>"更新广告消息失败！",
							"231610"=>"添加广告位失败！",
							"231611"=>"添加招客宝账号失败！",
                            "231612"=>"招客宝账号已经添加！",
                            "231613"=>"保存的排名超过了该位置的最大数量，保存失败！",
                            "231614"=>"保存的排名有重复，保存失败！",
                            "231615"=>"同一位置不同排名不能有重复的产品，保存失败！",
							
							// 财务类 <700
							"231650"=>"扣款失败！",
							"231651"=>"冻结失败！",
							"231652"=>"解冻失败！",
							"231653"=>"退款失败！",
							"231654"=>"牛币扣款失败！",
							"231655"=>"赠币扣款失败！",
							"231656" => "供应商账户不存在，查询供应商财务消耗失败！",
							
							// 校验类<750
							"231700"=>"打包日期无效！",
							"231701"=>"输入参数有误，accountId和period必须皆为合法约定数值！",
							"231702"=>"该供应商不存在收客宝帐号！",
							"231703"=>"获取供应商ID入参错误：accountId错误！",
							"231704"=>"未查询到该产品信息导致无法出价！",
							"231705"=>"获取参数price错误，必须是正数，且小数点位数最多为两位！",
							"231706"=>"产品ID不能为空！",
							"231707"=>"充值金额必须大于0元！",
							"231708"=>"您所发布的产品有正在推广中的，打包计划不能发布！产品：",
							"231709"=>"您所发布的产品有正在推广中的，以下产品不能发布，保存失败！产品：",
							
							/*** 前台失败定义 end ***/
						); 	
 }
?>
